	const g_data = ['illusion','light','wood','big',
					'flower','mirror','return','shield',
					'silent','storm','sword','wind','wood']   

	const g_card_info ={ 
		'wood':{
			'name': '「树」牌',
			'desc':'稳健的成长，或者代表着发展。在人际关系上得到信赖，与朋友缔结下深厚的关系。不仅才能与能力得以发挥，并能得到许多赞赏'
		},
		'illusion':{
			'name':'「幻」牌',
			'desc':'你的心思一直被紧迫而来的表面上的变化所占据，有不愿面对现实的倾向。即使生活或工作的环境改变，也别忘记每个人都拥有适应力。'
		},
		'light':{
			'name':'「光」牌',
			'desc':'身为耀眼光辉的存在，你聚集众多注目焦点于一身。不论做什么都能顺利进行，有着最棒的运气；不仅拿手的事与才能更能发挥，单恋的人也将有机会来临。'
		},
		'big':{
			'name':'「大」牌',
			'desc':'知识欲极为旺盛的时期。对于做好的计划，自己的可塑性，更是加以提升的好机会。　可以期待你一直以为不可能实现的爱情与梦想成真。'
		},
		'flower':{
			'name':'「花」牌',
			'desc':'今的努力终于开花结果了，而且绝佳的机会也即将到来！　只要能以乐观进取的心情，带着自信行动，一切都会往好的方向展开。'
		},
		'mirror':{
			'name':'「镜」牌',
			'desc':'自己本身所拥有的长处和短处，可以藉由他人对你的态度中知道。尤其是让你感觉到讨厌的人的缺点，更常常是你本身缺点的反射'
		},
		'return':{
			'name':'「戾」牌',
			'desc':'挂在心上的事，一直放着没处理的事，就趁这个机会一起解决了吧。被贴上畏首畏尾卷标的人也得以挽回名誉。　明快干脆的作为让你运气上升'
		},
		'shield':{
			'name':'「盾」牌',
			'desc':'即使有危机接近你，但你身边的所有人会把你保护得固若金汤。　尤其如果是为了爱与和平，则有可能得到更为强大的力量。'
		},
		'silent':{
			'name':'「静」牌',
			'desc':'乍看之下虽然不起眼，但你的正直早已被所有的人肯定。　你理所当然过着踏实并已完成自己责任的生活，最近或许会有好消息降临喔。'
		},
		'storm':{
			'name':'「岚」牌',
			'desc':'一直压抑着的感情或恐惧一口气表面化，可能遇到严厉的状况。　着想改善状况，必须割舍消极的一面，你可以对自己的主张再多坚持一点。'
		},
		'sword':{
			'name':'「剑」牌',
			'desc':'真实与力量的象征。　一切事实都能够按照你的心意顺利进行。　尤其是如果你播下的是真实的种子，一定能够得到最棒的收获。'
		},
		'wind':{
			'name':'「风」牌',
			'desc':'变化、飞跃的时期。　能够获得有意义情报的可能性也很大。　要比平常多注意状况，详加观察。　当看准时机已到时，下定决心也是很重要的。'
		}
	}  